In [2]:
import pandas as pd
pd.options.display.max_colwidth = 100

In [28]:
import datetime
todaydate = datetime.datetime.now().strftime("%Y-%m-%d")

In [3]:
df = pd.read_csv("../../../data/kdwd/item_no_desc.csv").set_index(["item_id"]).dropna()
# Dropna 43232907 to 43232888 (-19)

In [4]:
mask = df.en_label.str.contains(r'2dfgrs', na=True)

In [5]:
df = df[df.en_label.str.contains(r'2dfgrs', na=True)==False]
# 43232888 to 43217120 (-15,768)

In [6]:
df.tail()

                en_label
item_id
77257403  jean sallebert
77257405  georges salles
77257412     henri serre
77257430     guy viossat
77257434    charly aknin

In [7]:
df[df.index==58910089]['en_label']

Series([], Name: en_label, dtype: object)

In [8]:
df['length'] = df.en_label.str.len()

In [11]:
df["en_label"] = df["en_label"].str.lower()
df.drop_duplicates(subset=["en_label"], keep="first", inplace=True)

In [13]:
df # 43217120 - 39352821 (-3,864,299)

                     en_label  length
item_id
1                    universe       8
2                       earth       5
3                        life       4
4                       death       5
5                       human       5
...                       ...     ...
77257377      pierre mignucci      15
77257382  bernard pedebernard      19
77257403       jean sallebert      14
77257430          guy viossat      11
77257434         charly aknin      12

[39352821 rows x 2 columns]

In [14]:
df["length"].mean()

55.76032523818305

In [15]:
df["length"].mode()

0    15
dtype: int64

In [18]:
df[df.en_label.str.len()>25]

,en_label,length
item_id,,
54,all your base are belong to us,30
101,lopado temacho selacho galeo kranio leipsano drim hypo trimmato silphio parao melito katakechy m...,210
102,pneumonoultramicroscopicsilicovolcanoconiosis,45
103,supercalifragilisticexpialidocious,34
133,mixed-member proportional representation,40
...,...,...
77257088,football at the 1906 intercalated games â€“ men's tournament,58
77257089,tug of war at the 1906 intercalated games â€“ men's event,55
77257096,the welsh educational publishing company,40
77257169,early sources of scottish history a.d. 500 to 1286,50
77257218,"caversham presbyterian church, dunedin",38

In [19]:
df = df[df.en_label.str.len()<25]

In [20]:
df # 39352821 - 23311031 = 15592251 records

                     en_label  length
item_id
1                    universe       8
2                       earth       5
3                        life       4
4                       death       5
5                       human       5
...                       ...     ...
77257377      pierre mignucci      15
77257382  bernard pedebernard      19
77257403       jean sallebert      14
77257430          guy viossat      11
77257434         charly aknin      12

[15592251 rows x 2 columns]

In [22]:
del df['length']

In [23]:
df

                     en_label
item_id
1                    universe
2                       earth
3                        life
4                       death
5                       human
...                       ...
77257377      pierre mignucci
77257382  bernard pedebernard
77257403       jean sallebert
77257430          guy viossat
77257434         charly aknin

[15592251 rows x 1 columns]

In [24]:
df.to_csv(f"../../../data/kdwd/{todaydate}/item_reduced.csv")

In [26]:
df = pd.read_csv("../../../data/kdwd/property.csv").set_index(["property_id"])
del df["en_description"]
df["en_label"] = df["en_label"].str.lower()
df.drop_duplicates(subset=["en_label"], keep="first", inplace=True)

In [29]:
df['length'] = df.en_label.str.len()

In [30]:
df["length"].mean()

20.602576950608448

In [32]:
df.shape

(6985, 2)

In [33]:
df[df.en_label.str.len()<25].shape

(4962, 2)

In [36]:
df = df[df.en_label.str.len()<25]
del df['length']

In [37]:
df.to_csv(f"../../../data/kdwd/{todaydate}/property_reduced.csv")

In [44]:
df = pd.read_csv("../../../data/kdwd/item_aliases.csv").set_index(["item_id"])
df["en_alias"] = df["en_alias"].str.lower()
df.drop_duplicates(subset=["en_alias"], keep="first", inplace=True)

In [45]:
df.shape

(4687734, 1)

In [46]:
df = df[df.en_alias.str.len()<25]

In [47]:
df.shape

(3581900, 1)

In [49]:
df.rename(columns = {'en_alias':'en_label'}, inplace=True)

In [50]:
df.to_csv(f"../../../data/kdwd/{todaydate}/item2_reduced.csv")

In [60]:
df = pd.read_csv("../../../data/kdwd/property_aliases.csv").set_index(["property_id"])
print(df.shape)
df["en_alias"] = df["en_alias"].str.lower()
df.drop_duplicates(subset=["en_alias"], keep="first", inplace=True)
df.rename(columns = {'en_alias':'en_label'}, inplace=True)
print(df.shape)

(9004, 1)
(8631, 1)

In [62]:
df = df[df.en_label.str.len()<25]
print(df.shape)

(7305, 1)

In [63]:
df.to_csv(f"../../../data/kdwd/{todaydate}/property2_reduced.csv")

In [68]:
all_ps = pd.concat(map(pd.read_csv, [f"../../../data/kdwd/{todaydate}/property_reduced.csv", f"../../../data/kdwd/{todaydate}/property2_reduced.csv"]), ignore_index=True).set_index(["property_id"])

In [70]:
all_ps.shape

(12267, 1)

In [71]:
all_ps.to_csv(f"../../../data/kdwd/p_12267.csv")

In [72]:
all_qs = pd.concat(map(pd.read_csv, [f"../../../data/kdwd/{todaydate}/item_reduced.csv", f"../../../data/kdwd/{todaydate}/item2_reduced.csv"]), ignore_index=True).set_index(["item_id"])

In [73]:
all_qs.shape

(19174151, 1)

In [74]:
all_qs.to_csv(f"../../../data/kdwd/q_19174151.csv")